Revit 2027 API
TagByExampleFailures Properties
The BuiltInFailures.TagByExampleFailures type exposes the following members.
Properties
Name | Description
CannotCreateTag |  The tag couldn't be created.
CannotCreateTagRotationWarning |  Tag by Example couldn't tag the host as it is not parallel to the example host.
CannotCreateTagWarning |  Tag by Example couldn't tag the host.
Top
See Also
Reference
BuiltInFailures.TagByExampleFailures Class
Autodesk.Revit.DB Namespace